
# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 1, 1, 8]],  # 1-P1/2
   # conv down
   [-1, 1, Conv, [128, 3, 2, 1, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3
  
   # avg-conv down
   [-1, 1, ADown, [256]],  # 5-P5/32
   
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 5
   
   # avg-conv down
   [-1, 1, ADown, [512]],  # 6-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 7
   
   # avg-conv down
   [-1, 1, ADown, [1024]],  # 8-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 9
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 10

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 16 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],  # 
   [[-1, 13], 1, Concat, [1]],  # cat head P4
   
   [4, 1, Conv, [128, 3, 2, 1, 16]],
   [[-1, 18], 1, Concat, [1]],

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 21 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],  # 
   [[-1, 10], 1, Concat, [1]],  # cat head P5

   [6, 1, Conv, [256, 3, 2, 1, 32]],
   [[-1, 23], 1, Concat, [1]],

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 26 (P5/32-large)

   # detect
   [[13, 16, 21, 26], 1, DDetect, [nc]],  # Detect(P3, P4, P5)
  ]
