# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 1, 1, 8]],  #
   # conv down
   [-1, 1, Conv, [128, 3, 2, 1, 2]],  # 1-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 3

   [-1, 1, Conv, [256, 3, 1, 1, 32]],  # 1-P2/4

   # avg-conv down
   [-1, 1, ADown, [256]],  # 5-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 6

   [-1, 1, Conv, [512, 3, 1, 1, 64]],  # 1-P2/4

   # avg-conv down
   [-1, 1, ADown, [512]],  # 5-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 9

   [-1, 1, Conv, [512, 3, 1, 1, 64]],  # 1-P2/4

   # avg-conv down
   [-1, 1, ADown, [1024]],  # 5-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 12
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 9], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 16

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 19

   # avg-conv-down merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P2

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 22 (P1_large)

   [-1, 1, ADown, [256]],  # 5-P5/32
   [[-1, 19], 1, Concat, [1]],  # cat head Conv P2

   [[5, 24], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 26 (P2_medium)

   [-1, 1, ADown, [512]],  # 5-P5/32
   [[-1, 16], 1, Concat, [1]],  # cat head Conv P3

   [[8, 28], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 30 (P1_small)
   
   [-1, 1, ADown, [1024]],  # 5-P5/32
   [[-1, 13], 1, Concat, [1]],  # cat head P4

   [[11, 32], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 34 (P1_verysmall)
   
   # detect
   [[22, 26, 30, 34], 1, DDetect, [nc]],  # Detect(P3, P4, P5)
  ]
