# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   # conv down
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 2

   # avg-conv down
   [-1, 1, Conv, [256, 3, 1]],
   
   [2, 1, Conv, [256, 1, 1]], 

   [[-1, 4], 1, Concat, [1]],

   # avg-conv down
   [-1, 1, ADown, [256]],  # 6-P5/32
   
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 7

   # avg-conv down
   [-1, 1, Conv, [512, 3, 1]], 

   [7, 1, Conv, [512, 1, 1]], 

   [[-1, 8], 1, Concat, [1]],
   
   # avg-conv down
   [-1, 1, ADown, [512]],  # 11-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 12

   # avg-conv down
   [-1, 1, Conv, [512, 3, 1]], 

   [12, 1, Conv, [512, 1, 1]], 

   [[-1, 13], 1, Concat, [1]],
   
   # avg-conv down
   [-1, 1, ADown, [1024]],  # 16-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 17
  ]

# gelan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [512, 256]],  # 18

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 12], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 21

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 24 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],  # 
   [[-1, 21], 1, Concat, [1]],  # cat head P4
   
   [6, 1, Conv, [128, 3, 2]],
   [[-1, 26], 1, Concat, [1]],

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 29 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],  # 
   [[-1, 18], 1, Concat, [1]],  # cat head P5

   [11, 1, Conv, [256, 3, 2]],
   [[-1, 31], 1, Concat, [1]],

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 34 (P5/32-large)

   # detect
   [[24, 29, 34], 1, DDetect, [nc]],  # Detect(P3, P4, P5)
  ]
