# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   [-1, 1, Silence, []],

   [-1, 1, Conv, [32, 3, 2]],  # 1-P1/2
  
   # conv down
   [-1, 1, Conv, [64, 3, 1, 1, 8]],  # 2-P1/2

   # conv down
   [-1, 1, Conv, [128, 3, 2, 1, 2]],  # 3-P2/4

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]],  # 4

   # avg-conv down
   [-1, 1, ADown, [256]],  # 5-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]],  # 6

   # avg-conv down
   [-1, 1, ADown, [512]],  # 7-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 8

   # avg-conv down
   [-1, 1, ADown, [1024]],  # 9-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 10
   
   # routing
   [2, 1, CBLinear, [[64]]], # 11
   [4, 1, CBLinear, [[64, 128]]], # 12
   [6, 1, CBLinear, [[64, 128, 256]]], # 13
   [8, 1, CBLinear, [[64, 128, 256, 512]]], # 14
   [10, 1, CBLinear, [[64, 128, 256, 512, 1024]]], # 15
  
   # conv down fuse
   [0, 1, Conv, [64, 3, 2]],  # 16-P1/2
   [[11, 12, 13, 14, 15, -1], 1, CBFuse, [[0, 0, 0, 0, 0]]], # 17

   # conv down fuse
   [-1, 1, Conv, [128, 3, 2]],  # 18-P2/4
   [[12, 13, 14, 15, -1], 1, CBFuse, [[1, 1, 1, 1]]], # 19

   # elan-1 block
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 2]],  # 20

   # avg-conv down fuse
   [-1, 1, ADown, [256]],  # 21-P3/8
   [[13, 14, 15, -1], 1, CBFuse, [[2, 2, 2]]], # 22

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 2]],  # 23

   # avg-conv down fuse
   [-1, 1, ADown, [512]],  # 24-P4/16
   [[14, 15, -1], 1, CBFuse, [[3, 3]]], # 25

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 26

   # avg-conv down fuse
   [-1, 1, ADown, [1024]],  # 27-P5/32
   [[15, -1], 1, CBFuse, [[4]]], # 2828

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [1024, 512, 256, 2]],  # 29
  ]

# gelan head
head:
  [
   # elan-spp block
   [29, 1, SPPELAN, [512, 256]],  # 30

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 26], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]],  # 33

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 23], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 2]],  # 36 (P3/8-small)

   # avg-conv-down merge
   [-1, 1, ADown, [256]],
   [[-1, 33], 1, Concat, [1]],  # cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 2]],  # 39 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, ADown, [512]],
   [[-1, 30], 1, Concat, [1]],  # cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [512, 1024, 512, 2]],  # 42 (P5/32-large)

   # detect
   [[36, 39, 42], 1, DDetect, [nc]],  # Detect(P3, P4, P5)
  ]
